Tekla Open API Reference for Tekla Structures 2025
ModelObject.GetUserProperty Method
Overload List
Name | Description
GetUserProperty(String, Double)
 Retrieves a double property for the model object.
GetUserProperty(String, Int32)
 Retrieves an integer property for the model object.
GetUserProperty(String, String)
 Retrieves a string property for the model object.
Top
See Also
Reference
ModelObject Class
Tekla.Structures.Model Namespace